<!--
* @FileDescription: 水印设置
* @Date: 2022年05月15日 17:31:11
* TODO:
* [] 
-->

<script setup>
import vWaterMark from "~/directives/waterMark";
</script>

<template>
  <div v-water-mark class="w-80 h-80 bg-slate-400">
    <p> 这个有水印哦</p>
    <p> 这个有水印哦</p>
    <p> 这个有水印哦</p>
    <p> 这个有水印哦</p>
    <p> 这个有水印哦</p>
    <p> 这个有水印哦</p>
    <p> 这个有水印哦</p>
    <p> 这个有水印哦</p>
    <p> 这个有水印哦</p>
    <p> 这个有水印哦</p>
    <p> 这个有水印哦</p>
    <p> 这个有水印哦</p>
    <p> 这个有水印哦</p>
    <p> 这个有水印哦</p>
    <p> 这个有水印哦</p>
    <p> 这个有水印哦</p>
    <p> 这个有水印哦</p>
    <p> 这个有水印哦</p>
    <p> 这个有水印哦</p>
    <p> 这个有水印哦</p>
    <p> 这个有水印哦</p>
    <p> 这个有水印哦</p>
    <p> 这个有水印哦</p>
    <p> 这个有水印哦</p>
    <p> 这个有水印哦</p>
    <p> 这个有水印哦</p>
    <p> 这个有水印哦</p>
    <p> 这个有水印哦</p>
    <p> 这个有水印哦</p>
    <p> 这个有水印哦</p>
    <p> 这个有水印哦</p>
    <p> 这个有水印哦</p>
    <p> 这个有水印哦</p>
    <p> 这个有水印哦</p>
    <p> 这个有水印哦</p>
    <p> 这个有水印哦</p>
    <p> 这个有水印哦</p>
    <p> 这个有水印哦</p>
    <p> 这个有水印哦</p>
    <p> 这个有水印哦</p>
    <p> 这个有水印哦</p>
    <p> 这个有水印哦</p>
    <p> 这个有水印哦</p>
  </div>
</template>

<style lang="scss" scoped></style>
